### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [3]:

n = len(purchase_data["SN"].unique())

In [4]:
pd.DataFrame({"number of players": [n]})

   number of players
0                576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [5]:
#number of unique items
a= len(purchase_data["Item Name"].unique())
a

179

In [6]:
#average price
b= purchase_data["Price"].mean()
b

3.050987179487176

In [7]:
# Number of purchases
c= purchase_data["Purchase ID"].count()
c

780

In [8]:
#total revenue
d= purchase_data["Price"].sum()
d

2379.77

In [9]:
summary_data_frame = pd.DataFrame({
              "unique items": [a],
              "average price": [b],
              "Number of purchases": [c],
              "total revenue": [d]})

summary_data_frame

   unique items  average price  Number of purchases  total revenue
0           179       3.050987                  780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [10]:
df= purchase_data[["Gender", "SN", "Age"]]
df = df.drop_duplicates()

g= df["Gender"].value_counts()
g

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [11]:
p= g/n
p

Male                     0.840278
Female                   0.140625
Other / Non-Disclosed    0.019097
Name: Gender, dtype: float64

In [12]:
Gender_Demographic= pd.DataFrame({"count": g, "percentage": p})
Gender_Demographic

                       count  percentage
Male                     484    0.840278
Female                    81    0.140625
Other / Non-Disclosed     11    0.019097


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [13]:
purchase_coun= purchase_data.groupby(["Gender"]).count()["Purchase ID"]
purchase_coun

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [14]:
avg_price = purchase_data.groupby(["Gender"]).mean()["Price"]
avg_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [15]:
total_purchase_value = purchase_data.groupby(["Gender"]).sum()["Price"]
total_purchase_value

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [16]:
avg_total_purchase = total_purchase_value/g
avg_total_purchase

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [17]:
Purchasing_Analysis_Gender= pd.DataFrame({"purchase_coun": purchase_coun,
                                          "avg_price": avg_price,
                                          "total_purchase_value": total_purchase_value,
                                          "avg_total_purchase_per_person": avg_total_purchase
                                         })
Purchasing_Analysis_Gender

,purchase_coun,avg_price,total_purchase_value,avg_total_purchase_per_person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [18]:
#Establish bins for ages
label= ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
bins = [0,9.9,14.9,19.9,24.9,29.9, 34.9,39.9,9999]
bins

[0, 9.9, 14.9, 19.9, 24.9, 29.9, 34.9, 39.9, 9999]

In [19]:
#Categorize the existing players using the age bins. Hint: use pd.cut()
range_of_age= pd.cut(df["Age"], bins=bins, labels= label)
range_of_age

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
       ...
773    20-24
774    10-14
775    20-24
777    20-24
778      <10
Name: Age, Length: 576, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [20]:
#Calculate the numbers by age group
range_of_age_count= range_of_age.value_counts()
range_of_age_count

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age, dtype: int64

In [21]:
#Calculate the  percentages by age group
porcentage= range_of_age_count/n
porcentage

20-24    0.447917
15-19    0.185764
25-29    0.133681
30-34    0.090278
35-39    0.053819
10-14    0.038194
<10      0.029514
40+      0.020833
Name: Age, dtype: float64

In [22]:
#Create a summary data frame to hold the results
Age_Demographics= pd.DataFrame({"range_of_age": range_of_age,
                               "range_of_age_count": range_of_age_count,
                               "porcentage": porcentage
                               })
Age_Demographics

      range_of_age  range_of_age_count  porcentage
0            20-24                 NaN         NaN
1              40+                 NaN         NaN
2            20-24                 NaN         NaN
3            20-24                 NaN         NaN
4            20-24                 NaN         NaN
...            ...                 ...         ...
25-29          NaN                77.0    0.133681
30-34          NaN                52.0    0.090278
35-39          NaN                31.0    0.053819
40+            NaN                12.0    0.020833
<10            NaN                17.0    0.029514

[584 rows x 3 columns]

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [23]:
#Bin the purchase_data data frame by age
label= ["<10","10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
bins = [0,9.9,14.9,19.9,24.9,29.9, 34.9,39.9,9999]
purchase_data['range_of_age']= pd.cut(df["Age"], bins=bins, labels= label)
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,range_of_age
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,NaN
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,NaN

In [24]:
#Run basic calculations to obtain purchase count, apurchase_data,
#avg. purchase total per person etc. in the table below
#purchase_data_count
a= purchase_data.groupby(['range_of_age']).count()["Purchase ID"]
#average purchase price
b= purchase_data.groupby(['range_of_age']).mean()["Price"]
#total purchase value
total_purchase_value= purchase_data.groupby(['range_of_age']).sum()["Price"]
#avg total purchaseper person
c= total_purchase_value/range_of_age_count

In [25]:
#Create a summary data frame to hold the results

Purchasing_Analysis_Age= pd.DataFrame({"purchase_data_count": a,
                        "average purchase price": b,
                        "total_purchase_value": total_purchase_value,
                        "total purchaseper person":c})
Purchasing_Analysis_Age

,purchase_data_count,average purchase price,total_purchase_value,total purchaseper person
<10,17,3.390000,57.63,3.390000
10-14,22,3.074545,67.64,3.074545
15-19,107,3.101682,331.88,3.101682
20-24,258,3.063527,790.39,3.063527
25-29,77,2.908182,223.93,2.908182
30-34,52,2.921538,151.92,2.921538
35-39,31,3.510000,108.81,3.510000
40+,12,3.037500,36.45,3.037500

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [26]:
a= purchase_data.groupby(['SN']).count()["Purchase ID"]
b= purchase_data.groupby(['SN']).mean()["Price"]
c= purchase_data.groupby(['SN']).sum()["Price"]
Top_Spenders= pd.DataFrame({"avg Purchase count": a,
                           "avg Purchase Price": b,
                           "total purchase value": c
                           })
Top_Spenders

               avg Purchase count  avg Purchase Price  total purchase value
SN
Adairialis76                    1            2.280000                  2.28
Adastirin33                     1            4.480000                  4.48
Aeda94                          1            4.910000                  4.91
Aela59                          1            4.320000                  4.32
Aelaria33                       1            1.790000                  1.79
...                           ...                 ...                   ...
Yathecal82                      3            2.073333                  6.22
Yathedeu43                      2            3.010000                  6.02
Yoishirrala98                   1            4.580000                  4.58
Zhisrisu83                      2            3.945000                  7.89
Zontibe81                       3            2.676667                  8.03

[576 rows x 3 columns]

In [27]:
Top_Spenders_descending= Top_Spenders.sort_values( "total purchase value", ascending = False)
Top_Spenders_descending

             avg Purchase count  avg Purchase Price  total purchase value
SN
Lisosia93                     5            3.792000                 18.96
Idastidru52                   4            3.862500                 15.45
Chamjask73                    3            4.610000                 13.83
Iral74                        4            3.405000                 13.62
Iskadarya95                   3            4.366667                 13.10
...                         ...                 ...                   ...
Ililsasya43                   1            1.020000                  1.02
Irilis75                      1            1.020000                  1.02
Aidai61                       1            1.010000                  1.01
Chanirra79                    1            1.010000                  1.01
Alo38                         1            1.000000                  1.00

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [28]:
#Retrieve the Item ID, Item Name, and Item Price columns
Items= purchase_data[["Item ID", "Item Name", "Price"]]
Items

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [29]:
#Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value
#Items.groupby(["Item ID", "Item Name"]).count()
a= Items.groupby(["Item ID", "Item Name"]).count()["Price"]
b= Items.groupby(["Item ID", "Item Name"]).mean()["Price"]
c= Items.groupby(["Item ID", "Item Name"]).sum()["Price"]

In [30]:
#Create a summary data frame to hold the results
Most_Popular_Items= pd.DataFrame({"purchase count": a, "item price": b, "total purchase value": c })
Most_Popular_Items.head()

                            purchase count  item price  total purchase value
Item ID Item Name
0       Splinter                         4      1.2800                  5.12
1       Crucifer                         4      2.9425                 11.77
2       Verdict                          6      2.4800                 14.88
3       Phantomlight                     6      2.4900                 14.94
4       Bloodlord's Fetish               5      1.7000                  8.50

In [31]:
#Sort the purchase count column in descending order

Most_Popular_Items_descending= Most_Popular_Items.sort_values("purchase count", ascending= False)
Most_Popular_Items_descending.head()

,,purchase count,item price,total purchase value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
145,Fiery Glass Crusader,9,4.580000,41.22
132,Persuasion,9,3.221111,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.530000,31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [32]:
Most_Profitable_Items = Most_Popular_Items_descending.sort_values("total purchase value", ascending= False)
Most_Profitable_Items.head()

,,purchase count,item price,total purchase value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80